Revit 2024 API
BuiltInFailures.WallFailures.CannotMaintainKeyReference Property
 Can't maintain the position of the Location Line in this Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMaintainKeyReference { get; }
Visual Basic
Public Shared ReadOnly Property CannotMaintainKeyReference As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMaintainKeyReference {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace